DataMiningAndMachineLearning.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-09-14 周一 18:06 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>数据挖掘与机器学习课程笔记</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="梁子" />
</head>
<body>
<div id="content">
<h1 class="title">数据挖掘与机器学习课程笔记</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org21ba2be">1. overview</a>
<ul>
<li><a href="#orgcd35f0c">1.1. data mining的目的      ---&#x2013;&#x2014;&gt; 为了让数据更好地被使用,由用户界定而非程序员</a>
<ul>
<li><a href="#org9699538">1.1.1. 实体聚焦</a></li>
<li><a href="#orgce156e6">1.1.2. history</a></li>
</ul>
</li>
<li><a href="#org60e43e7">1.2. quality of Data management</a>
<ul>
<li><a href="#org02d31b3">1.2.1. Intrinsic Data quality:</a></li>
<li><a href="#orgfb796be">1.2.2. Contextual Data Quality: 数据的质量和要解决的问题相关</a></li>
<li><a href="#org2df8684">1.2.3. Representational Data quality:</a></li>
<li><a href="#org441b984">1.2.4. accessibility data quality 数据的可访问性</a></li>
</ul>
</li>
<li><a href="#org43e703c">1.3. 闲谈</a></li>
<li><a href="#org3cad8e9">1.4. 软件包</a></li>
<li><a href="#org445c0fe">1.5. 数据集</a></li>
<li><a href="#org6b2c69c">1.6. 相关顶级期刊和会议</a></li>
</ul>
</li>
<li><a href="#org20b9e31">2. introduction : Data Mining</a>
<ul>
<li><a href="#orge58e0a5">2.1. something(concepts) of data mining</a>
<ul>
<li><a href="#org9923e6a">2.1.1. 闲谈</a></li>
<li><a href="#org4c8b8a3">2.1.2. KDD： Knowledge Discovery from DATA</a></li>
<li><a href="#org6ee68cd">2.1.3. KDD的四个过程:</a></li>
</ul>
</li>
<li><a href="#orgf788aaa">2.2. (concepts) of machine learning</a>
<ul>
<li><a href="#org400d52f">2.2.1. supervised learning</a></li>
<li><a href="#orgace71f7">2.2.2. unsupervised learning</a></li>
<li><a href="#org896f4de">2.2.3. semi-supervised learning (弱监督学习)</a></li>
</ul>
</li>
<li><a href="#org791b725">2.3. differences(concepts) of Machine learning, Data Mining, and Statistics.</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
朱晓燕，计院，xjtueden@163.com
</p>

<p>
WangJiayin 计算机学院，
</p>

<p>
赖欣，
</p>


<p>
数据挖掘的一些工具与软件平台
</p>

<p>
<a href="http://www.kdnuggets.com/software">http://www.kdnuggets.com/software</a>
</p>

<p>
CRISP-DM 
</p>


<div id="outline-container-org21ba2be" class="outline-2">
<h2 id="org21ba2be"><span class="section-number-2">1</span> overview</h2>
<div class="outline-text-2" id="text-1">
<p>
大，智，云，移
</p>
</div>

<div id="outline-container-orgcd35f0c" class="outline-3">
<h3 id="orgcd35f0c"><span class="section-number-3">1.1</span> data mining的目的      ---&#x2013;&#x2014;&gt; 为了让数据更好地被使用,由用户界定而非程序员</h3>
<div class="outline-text-3" id="text-1-1">
<p>
数据很多，知识很少
</p>
<ol class="org-ol">
<li>数据很多，但是却找不到</li>
<li>数据之间的矛盾（由于角度不同，基线不同等等产生的）</li>
<li>非人类直接理解的数据：解决跨行业的人对非直接理解信息的理解问题</li>
</ol>
</div>



<div id="outline-container-org9699538" class="outline-4">
<h4 id="org9699538"><span class="section-number-4">1.1.1</span> 实体聚焦</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
当很难通过模型的某一单一维度去判断实体时，怎么知道某些事情来自于同一个实体
</p>
</div>
</div>

<div id="outline-container-orgce156e6" class="outline-4">
<h4 id="orgce156e6"><span class="section-number-4">1.1.2</span> history</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
数据库,数据收集&#x2013;&gt; 关系模型&#x2013;&gt;基本的数据挖掘算法
</p>
</div>
</div>
</div>

<div id="outline-container-org60e43e7" class="outline-3">
<h3 id="org60e43e7"><span class="section-number-3">1.2</span> quality of Data management</h3>
<div class="outline-text-3" id="text-1-2">
<p>
数据挖掘来自于数据管理
</p>

<p>
数据质量包括:
</p>
<ol class="org-ol">
<li>数据的数量;</li>
<li>数据的客观性;(看起来客观的数据都具有一定的主观性),重点</li>
<li>数据的可靠性;</li>
<li>数据的时限性;</li>
</ol>
</div>


<div id="outline-container-org02d31b3" class="outline-4">
<h4 id="org02d31b3"><span class="section-number-4">1.2.1</span> Intrinsic Data quality:</h4>
<div class="outline-text-4" id="text-1-2-1">
<ol class="org-ol">
<li>准确度;accuracy; 关于数据的,数据要准确</li>
<li>客观性;objectivity   以一个条件概率的形式隐含着,也就是非完全的客观.</li>
<li>可信度;believability</li>
<li>reputation</li>
</ol>
</div>
</div>

<div id="outline-container-orgfb796be" class="outline-4">
<h4 id="orgfb796be"><span class="section-number-4">1.2.2</span> Contextual Data Quality: 数据的质量和要解决的问题相关</h4>
<div class="outline-text-4" id="text-1-2-2">
<ol class="org-ol">
<li>Relevancy       一定要挑拣相关的数据,不要啥数据都往里面塞</li>
<li>value-added</li>
<li>timeliness</li>
<li>completeness</li>
<li>Amount of Data  小样本学习的重要性 , 如何去遏制过拟合</li>
</ol>
</div>
</div>

<div id="outline-container-org2df8684" class="outline-4">
<h4 id="org2df8684"><span class="section-number-4">1.2.3</span> Representational Data quality:</h4>
<div class="outline-text-4" id="text-1-2-3">
<ol class="org-ol">
<li>Interpretability  可解释性,人工智能的最大问题,目前:a)追求精度;b)追求可解释性,使用推理</li>
<li>Ease of understanding</li>
<li>Concise representation</li>
<li>Consistent representation</li>
</ol>
</div>
</div>

<div id="outline-container-org441b984" class="outline-4">
<h4 id="org441b984"><span class="section-number-4">1.2.4</span> accessibility data quality 数据的可访问性</h4>
<div class="outline-text-4" id="text-1-2-4">
<ol class="org-ol">
<li>accessibility.</li>
<li>accessibility security.</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org43e703c" class="outline-3">
<h3 id="org43e703c"><span class="section-number-3">1.3</span> 闲谈</h3>
<div class="outline-text-3" id="text-1-3">
<p>
技术专家: 懂模型的人  &#x2014;&gt; 很多,不缺
领域专家:           &#x2014;&gt; 很缺
</p>

<p>
累进学习 &lt;-&gt; 在线学习
</p>
</div>
</div>


<div id="outline-container-org3cad8e9" class="outline-3">
<h3 id="org3cad8e9"><span class="section-number-3">1.4</span> 软件包</h3>
<div class="outline-text-3" id="text-1-4">
<p>
建议:
</p>

<ol class="org-ol">
<li>不要只听模型,从代码层面去理解;</li>
<li>大作业是根据软件包开发一个实际能用的平台结果</li>
</ol>
</div>
</div>

<div id="outline-container-org445c0fe" class="outline-3">
<h3 id="org445c0fe"><span class="section-number-3">1.5</span> 数据集</h3>
</div>

<div id="outline-container-org6b2c69c" class="outline-3">
<h3 id="org6b2c69c"><span class="section-number-3">1.6</span> 相关顶级期刊和会议</h3>
</div>
</div>




<div id="outline-container-org20b9e31" class="outline-2">
<h2 id="org20b9e31"><span class="section-number-2">2</span> introduction : Data Mining</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orge58e0a5" class="outline-3">
<h3 id="orge58e0a5"><span class="section-number-3">2.1</span> something(concepts) of data mining</h3>
<div class="outline-text-3" id="text-2-1">
<p>
data is NOT information.
</p>

<p>
Information: the result of organizing data into meaningful quantities.
</p>

<p>
database: 一种结构化的数据的集合 &#x2013;&gt;被认为是信息。
</p>

<p>
数据挖掘：从信息中间将所需要的东西挖掘出知识（knowledge)来
</p>

<p>
数据挖掘的要求：  （Knowledge Discovery in Databases）
</p>
<ol class="org-ol">
<li>valid</li>
<li>Novel</li>
<li>useful</li>
<li>understandable</li>
</ol>

<p>
数据挖掘的几个类别：
</p>
<ol class="org-ol">
<li>Database  information struct data</li>
<li>algorithm</li>
<li>information retrieval</li>
<li>statistics</li>
<li>machine learning 机器学习只是数据挖掘中的一种，往往不是最有效的</li>
</ol>
<p>
others： visualization
</p>
</div>

<div id="outline-container-org9923e6a" class="outline-4">
<h4 id="org9923e6a"><span class="section-number-4">2.1.1</span> 闲谈</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
数据孪生技术
</p>
</div>
</div>
<div id="outline-container-org4c8b8a3" class="outline-4">
<h4 id="org4c8b8a3"><span class="section-number-4">2.1.2</span> KDD： Knowledge Discovery from DATA</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
Data minine 是KDD的一个环节
</p>

<p>
抛出一个问题&#x2013;KDD过程,从数据中获得knowledge&#x2013;&gt;将知识应用到问题解决中去results&#x2014;&gt;得到一些新的策略strategy
</p>

<p>
&lt;NEEDPIC: ROles in the KDD process&gt;
</p>
</div>
</div>
<div id="outline-container-org6ee68cd" class="outline-4">
<h4 id="org6ee68cd"><span class="section-number-4">2.1.3</span> KDD的四个过程:</h4>
<div class="outline-text-4" id="text-2-1-3">
<ol class="org-ol">
<li>Data consolidation
<ul class="org-ul">
<li></li>

<li>基本原则:garbage in, garbage out
<ul class="org-ul">
<li>从多个数据库综合数据</li>
<li>选取部分特征</li>
<li>对missing value进行处理</li>
<li>删掉异常值</li>
<li>确定合适的分布</li>
</ul></li>
</ul></li>
<li>selection &amp; preprocessing
<ul class="org-ul">
<li>需要做一些清洗</li>
<li>基本步骤:
<ul class="org-ul">
<li>选取一个实例的集合</li>
<li>属性降维 reduce attribute dimensionality</li>
<li>reduce attribute value ranges a)对异常值进行处理;b)仅仅对关心的特征进行此等处理</li>
<li>transform data 如归一化等变换.</li>
</ul></li>
</ul></li>

<li>data mining
<ul class="org-ul">
<li>选择与数据或者领域相适合的数据挖掘方法</li>
<li>当数据量很小的时候,更适合用小样本学习相关的数据,而非NN</li>
<li>若数据集中不同标签的数据的分布很不平衡,就需要模型可以处理典型的非平衡型数据集</li>
<li>基本步骤:
<ul class="org-ul">
<li>Kinds of data to be mined
<ul class="org-ul">
<li>比如,粒子群更适合于连续数据,蚁群算法更适合于离散数据</li>
<li>再比如,对二值函数的回归操作</li>
</ul></li>
<li>Kinds of knowledge to be discovered
<ul class="org-ul">
<li>比如,做关联分析. 比如研究基因突变问题(基因与性状的关系), 如果是单一基因,可用(T检验,似乎是统计学里的??), 但当是多个基因的逻辑规则结合时, t检验却可能不再有效, 而是决策树等方法比较有效.</li>
</ul></li>
<li>Kinds of techniques utilized</li>
<li>Kinds of application</li>
<li>&lt;NEEDPIC: Applications,operations,techniques&gt;</li>
</ul></li>
</ul></li>
<li>interpretation and evaluation
<ul class="org-ul">
<li>something</li>

<li>挖掘出来的pattern是否有用? 可以从数据中挖掘的大量的pattern,而其中大部分都是无用的.
<ul class="org-ul">
<li>逻辑上说得通. easily understood by human;</li>
<li>在新的数据集上有效</li>
<li>具有潜在意义 potentially useful</li>
<li>novel, or validates some hypothesis that a user seeks to confim.</li>
</ul></li>
<li>pattern完整性(completeness)与优化性(optimization)的权衡
<ul class="org-ul">
<li>只挖掘感兴趣的东西</li>
</ul></li>
<li>evaluation
<ul class="org-ul">
<li>统计验证,专家评估,失效条件</li>
</ul></li>
<li>interpretation</li>
<li>visualization</li>
</ul></li>
<li>Major Issues
<ol class="org-ol">
<li>mining  methodology
<ol class="org-ol">
<li>将不同模态的数据融合;</li>
<li>方法的效果</li>
<li>检验</li>
<li>噪声抵制</li>
<li>并行性,分布式,增量式</li>
<li>将知识集成起来,进行融合</li>
</ol></li>
<li>用户交互</li>
<li>应用..</li>
<li>precise patterns VS approximate patterns</li>
<li>constrained vs no-constrained patterns</li>
</ol></li>
</ol>



<p>
problem需要被关心,尤其是关于数据的表示
</p>
</div>
</div>
</div>

<div id="outline-container-orgf788aaa" class="outline-3">
<h3 id="orgf788aaa"><span class="section-number-3">2.2</span> (concepts) of machine learning</h3>
<div class="outline-text-3" id="text-2-2">
</div>
<div id="outline-container-org400d52f" class="outline-4">
<h4 id="org400d52f"><span class="section-number-4">2.2.1</span> supervised learning</h4>
</div>

<div id="outline-container-orgace71f7" class="outline-4">
<h4 id="orgace71f7"><span class="section-number-4">2.2.2</span> unsupervised learning</h4>
<div class="outline-text-4" id="text-2-2-2">
</div>
<ol class="org-ol">
<li><a id="org596a8cc"></a>cluster<br /></li>

<li><a id="org4fe51f1"></a>graph mining<br /></li>
</ol>
</div>

<div id="outline-container-org896f4de" class="outline-4">
<h4 id="org896f4de"><span class="section-number-4">2.2.3</span> semi-supervised learning (弱监督学习)</h4>
</div>
</div>


<div id="outline-container-org791b725" class="outline-3">
<h3 id="org791b725"><span class="section-number-3">2.3</span> differences(concepts) of Machine learning, Data Mining, and Statistics.</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: 梁子</p>
<p class="date">Created: 2020-09-14 周一 18:06</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
